<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'forum', language 'be', branch 'MOODLE_22_STABLE'
 *
 * @package   forum
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['forumtype_help'] = '<p>Вы можаце выбраць тып форуму:</p>

<p><b>Простае абмеркаванне</b> - складаецца з адной тэмы.
Звычайна выкарыстоўваецца для таго, каб сфакусаваць абмеркаванні на адной тэме.</p>

<p><b>Стандартны агульнамэтавы форум</b> - адкрыты форум у якім кожны можа распачаць новую тэму ў любы час.</p>

<p><b>Кожны дасылае адну тэму</b> - часам бывае карысна абмяжоўваць колькасць тэмаў, што ствараюцца карыстальнікамі.</p>

<p>Плануецца дадаць іншыя тыпы форумаў.</p>';
$string['maxattachmentsize_help'] = '<p>Максімальны памер далучкі акрэслівае той, хто адкрывае  форум.</p>

<p>Часам удаецца пераслаць файл большы, чым устаноўлены гэтым параметрам, аднак жа гэты файл не будзе захаваны на сэрверы і,  хутчэй за ўсё, будзе з’яўляцца паведамленне пра памылку.</p>';
$string['modulename_help'] = '<p><img alt="" src="<?php echo $CFG->wwwroot?>/mod/forum/icon.gif" />&nbsp;<b>Форум</b></p>
<blockquote>
<p>Гэты модуль можа стацца найбольш важным – менавіта тут адбываецца большасць дыскусій. Форум можа мець розную структуру і даваць магчымасць ацэнкі кожнага паведамлення яго ўдзельнікамі. Паведамленні могуць праглядацца ў розных фарматах  і ўключаць дадаткі. Удзельнікі, якія з’яўляюцца падпісчыкамі форуму атрымаюць праз электронную пошту кожнае новае паведамленне. Вядоўца можа навязаць падпіску ўсім удзельнікам.</p>

</blockquote>';
$string['rssarticles_help'] = '<p>Гэта каманда дазволіць устанавіць колькасць артыкулаў у RSS Feed.</p>

<p>Найбольш адэкватная лічба ад  5 да 20. Яе можна павялічыць, калі форум вельмі актыўны.</p>';
$string['rsstype_help'] = '<p>З дапамогай гэтай каманды ўключаецца RSS крыніца навінаў у гэтым форуме.</p>

<p>Можна выбраць адзін з двух відаў форумаў: </p>

<ul>
<li><b>Дыскусія:</b> Уключае ў сябе новыя дыскусіі з першымі паведамленнямі.</li>

<li><b>Паведамленні:</b> У гэтай опцыі будзе адлюстроўвацца каждае паведамленне гэтага форуму.</li>
</ul>';
$string['subscription_help'] = '<p>Падчас падпіскі на форум, удзельнік атрымлівае копіі ўсіх паведамленняў праз e-mail (паведамленні дасылаюцца праз 30 хвілінаў пасля з\'яўлення на форуме).</p>
<p>Студэнт можа выбіраць падпісацца на форум ці не, за выключэннем выпадкаў, калі настаўнік зрабіў абавязковую падпіску на форум.</p>
<p>Абавязковая падпіска звычайна ўсталёўваецца на форумы навінаў.</p>';
$string['subscriptionmode_help'] = '<p>Той, хто падпісаны на  форум, будзе атрымаць на сваю э-скрынку копіі кожнага  паведамлення высланага на гэты форум. Паведамленні высылаюцца <?pHp echo $CFG->maxeditingtime/60 ?> хвілін пасля іх стварэння.</p>

<p>Звычайна ўдзельнікі могуць выбіраць, хочуць яны ці не быць падпісанымі на кожны  форум</p>

<p>Аднак, калі вырашыш запісацца на форум, то кожны ўдзельнік курса падпісваецца на гэты форум. Нават калі запісваецца на курс пазней.</p>

<p>Гэта функцыя асабліва карысная для форуму Навінаў і першага форуму курса.</p>

<p>Калі выбіраеш "Так, напачатку," то ўсе падпісаныя будуць мець магчымасць адпісацца. Каманда "Так, назаўсёды" запісвае ўсіх без магчымасці адпісацца.</p>

<p>Звярніце ўвагу, што замена каманды "Не" на "Так, напачатку" не запіша ўсіх  запісаных раней на асобаў на форум, а толькі новых удзельнікаў. Замена "Так, напачатку" на "Не" не  выпіша з форуму тых, хто на яго ўжо падпісаны. Будзе датычыць толькі новых курсантаў.</p>';
