<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'lesson', language 'be', branch 'MOODLE_22_STABLE'
 *
 * @package   lesson
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actionaftercorrectanswer_help'] = '<p>Звычайнае дзеянне, прытрымлівацца пераходу, як паказана ў адказе. У большасці выпадкаў будзе паказана Наступная старонка ўроку. Студэнт праходзіць урок у лагічнай паслядоўнасці: ад пачатку да канца.</p>

<p>З іншага боку, модуль уроку можа быць выкарыстаны для паказу <i>Флэш-Картаў</i>. Студэнту паказваецца некаторая інфармацыя (не абавязкова) і пытанне, як правіла, у выпадковым парадку. Няма вызначанага пачатку і канца. Толькі набор <i>Картаў</i>, што паказваюцца адна за другой у выпадковым парадку.</p>

<p>Гэтая опцыя дазваляе выбраць два вельмі простых варыянты паводзінаў Флэш-Картаў. Опцыя "Паказаць непрагледжаную старонку" ніколі не пакажа адну і тую ж старонку двойчы (нават калі студэнт <b>не</b> адказаў на пытанне звязанае з Картай/Старонкай правільна). Другая опцыя "Паказаць старонку пакінутую без адказу" дазваляе студэнту ўбачыць старонку, якая была ўжо паказаная, але адказ на адпавядаючае ёй пытанне быў няправільным.</p>

<p>У абодвух выпадках уроку Флэш-Картамі, настаўнік можа вырашыць ці варта выкарыстаць усе Карты/Старонкі, або выпадковую паслядоўнасць часткі з іх. Гэта выбіраецца праз параметр &quot;Колькасць старонак (картаў) для паказу&quot;.</p>';
$string['casesensitive_help'] = '<p>Некаторыя тыпы пытанняў маюць опцыі. Тыпы пытанняў і значэнні опцыяў прыведзеныя ніжэй.</p>

<ol>
<li><p><b>Некалькі з некалькіх.</b> Гэты варыянт Множнага выбару завецца <b>&quot;Некалькі з некалькіх&quot;</b>. Калі функцыя "Опцыі пытання" вылучаная, то студэнт павінен выбраць усе правільныя адказы з прапанаваных варыянтаў. У пытанні можа гаварыцца <i>колькі</i> правільных адказаў мае пытанне. Напрыклад пытанне "Хто з ніжэйпрыведзеных асобаў быў прэзідэнтам?" - не гаворыць аб колькасці правільных адказаў, у той час як, "Вылучыце двух прэзідэнтаў з прапанаванага спісу" - гаворыць. Лік правільных адказаў можа вагацца ад <b>аднаго</b> да мноства варыянтаў адказаў. (Множны выбар "Некалькі з некалькіх" з адным правільным адказам і Множны выбар "Адзін з некалькіх" цалкам два розных тыпы пытання, бо першы дазваляе студэнту выбраць больш за адзін адказ, а апошні прадугледжвае выбар толькі аднаго адказу).</p></li>

<li><p><b>Кароткі адказ.</b> Па змаўчанні пры параўнанні адказу ігнаруецца рэгістр. Калі функцыя "Опцыі пытання" выбраная, то пры параўнанні адказу ўлічваецца рэгістр.</p></li>
</ol>

<p>Іншыя тыпы пытанняў не выкарыстаюць функцыю "Опцыі пытання".</p>';
$string['handlingofretakes_help'] = '<p>Калі студэнту дазволена пераздаваць заданне, гэтая опцыя дазваляе настаўніку задаць які вынік адлюстроўваць на старонцы "Адзнакі". Пры значэнні <b>Сярэдні</b> - адлюстроўваецца сярэдняя адзнака па выніках першай і ўсіх наступных спробаў праходжання ўроку. Пры значэнні <b>Лепшы</b> - адлюстроўваецца адпаведна максімальны вынік незалежна ад колькасці спробаў пераздач.</p>

<p>Гэтая опцыя можа быць змененая ў любы час</p>';
$string['importquestions_help'] = '<p>Гэтая функцыя дазваляе імпартаваць пытанні са знешніх тэкставых файлаў, што загружаюцца праз форму.</p>

<p>Падтрымліваюцца наступныя фарматы:</p>

<p><b>Фармат GIFT</b></p>
<ul>
<p>GIFT з\'яўляецца найбольш поўным фарматам даступным для імпартавання пытанняў у тэсты сістэмы Moodle з тэкставага файла. Ён быў распрацаваны для магчымасці падрыхтоўкі пытанняў для тэстаў у выглядзе тэкставага файла. Ён падтрымлівае Множны адказ, Адказ Так/Не, Кароткі адказ, Лічбавы адказ, Адпаведнасці, Устаўка слова замест прабелу і іншыя тыпы пытанняў. Розныя тыпы пытанняў могуць быць выкарыстаныя ў адным тэкставым файле. Фармат гэтак жа падтрымлівае Каментары, Назвы пытанняў, Зваротную сувязь і Адзнаку. Ніжэй прыведзеныя некалькі прыкладаў:</p>
<pre>
Хто пахаваны ў магіле Гранта?{~Грант ~Джэферсан =ніхто}

Грант {~пахаваны =пахаваны ~жыве} у магіле Гранта.

Грант пахаваны ў магіле Гранта.{FALSE}

Хто пахаваны ў магіле Гранта?{=ніхто =магіла пустая}

Калі нарадзіўся Грант?{#1822}
</pre>

<p align=right><a href="help.php?file=formatgift.html&module=quiz">Даведацца больш аб фармаце "GIFT"</a></p>
</ul>

<p><b>Фармат Aiken</b></p>
<ul>
<p>Фармат Aiken вельмі просты спосаб стварэння пытанняў тыпу Множны адказ. Ён выкарыстоўвае вельмі просты сінтаксіс. Прыклад:
</p>
<pre>
Якая мэта першай дапамогі?
A. Захаваць жыццё, папярэдзіць далейшае пашкоджанне, захаваць здароўя
B. Забяспечыць медыцынскую дапамогу пацярпеламу
C. Папярэдзіць далейшае пашкоджанне
D. Дапамагчы пацярпеламу, які просіць дапамогі
АДКАЗ: A
</pre><p align=right><a href="help.php?file=formataiken.html&module=quiz">Даведацца больш аб фармаце "Aiken"</a></p>
</ul>


<p><b>Прапушчанае слова</b></p>
<ul>
<p>Гэты фармат падтрымлівае толькі пытанне тыпу Множны адказ. Кожны адказ аддзелены знакам тыльды (~), а правільны адказ аддзелены знакам роўна (=). Прыклад:

<blockquote>Перш чым пачаць вывучаць часткі нашага цела як немаўляты, мы станем студэнтамі{=анатоміі і фізіялогіі ~рэфлекталогіі ~навукі ~эксперыменту}, і застанемся студэнтамі на ўсё жыццё.
</blockquote>

<p align="right"><a href="help.php?file=formatmissingword.html&module=quiz">Даведацца больш аб фармаце "Прапушчанае слова"</a></p>
</ul>


<p><b>АОН</b></p>
<ul>
<p>Гэта той жа самы фармат Прапушчанае слова, за выключэннем таго, што пасля імпартавання ўсе пытанні тыпу Кароткі адказ канвертуецца чатыры за раз у тып Адпаведнасцяў.</p>
<p>У дапаўненне, адказы ад пытанняў тыпу Множны адказ змешваюцца выпадковым чынам падчас імпарту</p>
<p>Фармат мае назву ў гонар арганізацыі, якая спансавала распрацоўку мноства опцыяў для тэставання.</p>
</ul>


<p><b>Blackboard</b></p>
<ul>
<p>Гэты модуль можа імпартаваць пытанні, захаваныя ў фармаце экспарту з Blackboard. Ён заснаваны на функцыі XML скампіляванай у PHP</p>

<p align="right"><a href="help.php?file=formatblackboard.html&module=quiz">Даведацца больш аб "Blackboard"</a></p>
</ul>

<p><b>Менеджэр тэстаў</b></p>
<ul>
<p>Гэты модуль можа імпартаваць пытанні, захаваныя ў фармаце Course Test Manager. Ён заснаваны на розных шляхах доступу ў банк тэстаў, такіх як база дадзеных Microsoft Access, у залежнасці ад таго, на якой платформе працуе Moodle-сэрвер, на Windows або на Linux.</p>
<p>На Windows - гэта дае магчымасць загрузіць базу дадзеных як любы другі файл.</p>
<p>На Linux мусіць быць усталяваны ODBC кампанент для доступу да машыны з Windows, на якой захоўваецца сеткавы тэст</p>
<p>Прачытайце ўважліва раздзел ніжэй перш чым выкарыстаць гэта экспартаванне.</p>


<p align="right"><a href="help.php?file=formatctm.html&module=quiz">Даведацца больш аб фармаце "Менеджэр тэстаў"</a></p>
</ul>

<p><b>Самаробны</b></p>
<ul>
<p>Калі Вы маеце уласны фармат, які вы жадаеце імпартаваць, Вы можаце ўжыць яго самастойна апісаўшы ў mod/quiz/format/custom.php

<p>Памер кода для дадавання вельмі малы, толькі каб вылучыць пытанне з азначанага тэксту.

<p align="right"><a href="help.php?file=formatcustom.html&module=quiz">Даведацца больш аб фармаце "Самаробны"</a></p>
</ul>


<p>Мноства фарматаў яшчэ не ўкаранёна, уключаючы WebCT, IMS QTI і масу іншых. Карыстальнікі Moodle могуць зрабіць свой унёсак!</p>';
$string['jumps_help'] = '<p>Кожны адказ мае спасылку "Пераход". Пасля выбару адказу студэнту паказваецца каментар да адказу, пасля чаго ён бачыць старонку паказаную ў спасылцы "Пераход". Спасылка можа быць адносная і абсалютная. Адносная спасылка гэта - <b>Гэтая старонка</b> і <b>Наступная старонка</b>. <b>Гэтая старонка</b> азначае, што студэнт бачыць бягучую старонку яшчэ раз. <b>Наступная старонка</b> паказвае старонку паводле лагічнай паслядоўнасці старонак. Абсалютная спасылка ўтвараецца шляхам выбару <b>Загалоўка старонкі</b>.</p>
<p>Заўважце, што адносная спасылка на <b>Наступную старонку</b> можа паказаць іншую старонку, калі паслядоўнасць старонак была змененая, у той час як спасылка, якая выкарыстоўвае <b>Загаловак</b> заўсёды паказвае пазначанную старонку, нават калі яны былі перасунутыя.</p>';
$string['maxgrade_help'] = '<p>Гэты параметр вызначае максімальную адзнаку, якая можа быць атрыманая на ўроку ў дыяпазоне ад 0 да 100%. Яго значэнне можа быць змененае ў любы час. Любыя змяненні неадкладна ўплываюць на старонку "Адзнакі" і на адзнакі, якія адлюстроўваюцца для студэнтаў. Калі значэнне параметру "адзнака" роўны 0, то ўрок становіцца нябачным на розных старонках, якія змяшчаюць адзнакі.</p>';
$string['maximumnumberofanswersbranches_help'] = '<p>Гэты параметр вызначае максімальную колькасць адказаў, якія можа выкарыстаць настаўнік. Значэнне па змаўчанні роўна чатыром. Калі, да прыкладу, на працягу ўсяго ўроку выкарыстоўваецца толькі пытанні тыпу Так/Не, ёсць сэнс усталяваць гэты параметр роўным двум.</p>

<p>Гэты параметр таксама ўсталёўвае максімальную колькасць пунктаў у Табліцы зместу.</p>

<p>Цалкам бяспечна змяняць значэнне гэтага параметру ва ўроку, які ўжо існуе. Калі Вы жадаеце дадаць пытанне з вялікай колькасцю адказаў, або ўнесці вялікія змены ў змест, неабходна змяніць гэты параметр. Пасля таго, як змест быў зменены, або дададзенае пытанне - гэты параметр можна прывесці да больш &quot;стандартнага&quot; значэння.</p>';
$string['maximumnumberofattempts_help'] = '<p>Гэты параметр вызначае максімальную колькасць спробаў, якія можа зрабіць студэнт адказваючы на <b>любое</b> з пытанняў уроку. У выпадку, калі пытанне не прадстаўляе адказ, да прыкладу Кароткі адказ або Лічбавы, гэты параметр забяспечвае неабходны <i>пераход</i> да наступнай старонкі ўроку.</p>

<p>Значэнне па змаўчанні - 5. Меншае значэнне перашкаджае абдумванню пытання студэнтам. Большае значэнне вядзе да большага расчаравання студэнта.</p>

<p>Устаноўка гэтага значэння ў 1, дае студэнту толькі адну спробу адказаць на кожнае пытанне. У модулі Тэст маецца сапраўды такі параметр, розніца палягае ў тым, што кожнае пытанне мае асобную старонку.</p>

<p>Заўважце, што гэты параметр глабальны і ён распаўсюджваецца на ўсе пытанні тэсту, незалежна ад іх тыпу.</p>

<p>Заўважце, што гэты параметр <b>не</b> дзейнічае на праверку пытання або навігацыі па ўроку настаўнікам. Праверка колькасці спробаў грунтуецца на значэннях з базы дадзеных, і спробы зробленыя настаўнікам не залічваюцца. У рэшце рэшт настаўнік сам павінен ведаць адказ!</p>';
$string['minimumnumberofquestions_help'] = '<p>Калі ўрок утрымлівае адну або больш Табліц Зместу - гэты параметр звычайна ўсталёўваецца. Яго значэнне ўсталёўвае ніжнюю мяжу па колькасці пытанняў, якія разглядаюцца пры разліку адзнакі. Гэта <b>не</b> змушае студэнта адказваць  менавіта на гэтую колькасць пытанняў уроку.</p>

<p>Да прыкладу, усталяванне гэтага параметру ў значэнне 20, дае ўпэўненасць у тым, што студэнт бачыў, <b>прынамсі</b>, гэтую колькасць пытанняў, перш чым адзнака была выстаўленая. Разгледзім выпадак, калі студэнт паглядзеў змест уроку з 5-цю старонкамі і адказаў на ўсе адпаведныя пытанні правільна, пасля чаго быў выбраны канец уроку (у выпадку калі ёсць такі пункт у Табліцы зместу). Калі гэты параметр не быў вызначаны, адзнака была б 5 з 5, што азначае 100%. Аднак з устаноўкай гэтага параметру ў значэнне 20, адзнака была б зніжаная да 5 з 20 , што азначае 25%. У выпадку, калі студэнт прайшоў праз увесь урок і бачыў 25 старонак і пытанняў, але правільна адказаў толькі на 23 пытанні, ягоная адзнака была б 23 з 25, што азначае 92%.</p>

<p>Калі гэты параметр задзейнічаны, тады старонка уроку, якая адкрываецца, павінна паведаміць нешта накшталт:<p>

<p><blockquote>У гэтым уроку мяркуецца, што Вы павінны адказаць, прынамсі, на N пытанняў. Вы можаце адказаць на большую колькасць, калі жадаеце, аднак калі Вы адкажаце менш чым на N пытанняў, Вашая адзнака будзе разлічаная з разліку агульнай колькасці Вашых адказаў.</blockquote></p>

<p>Дзе, зразумела, &quot;N&quot; заменены значэннем параметру, які вы выбіраеце.</p>

<p>Калі гэты параметр усталяваны, студэнтам гаворыцца на колькі пытанняў яны адказалі і на колькі маюць даць адказ.</p>';
$string['modulename_help'] = '<img alt="" src="<?php echo $CFG->wwwroot?>/mod/lesson/icon.gif" />&nbsp;<b>Навучальная работа</b>

<blockquote>
<p>Навучальная работа даносіць навучальны матэрыял у цікавай і гнуткай форме. Ён складаецца з набору старонак. Кожная старонка звычайна заканчваецца пытаннем і пэўнай колькасцю магчымых адказаў. У залежнасці ад правільнасці выбару адказу, студэнт пераходзіць на наступную старонку або вяртаецца на папярэднюю. Навігацыя па навучальнай рабоце можа быць прамой або комплекснай, у залежнасці ад структуры матэрыялу, які выкладаецца.</p>
</blockquote>';
$string['multianswer_help'] = '<p>Некаторыя тыпы пытанняў маюць опцыі. Тыпы пытанняў і значэнні опцыяў прыведзеныя ніжэй.</p>

<ol>
<li><p><b>Некалькі з некалькіх.</b> Гэты варыянт Множнага выбару завецца <b>&quot;Некалькі з некалькіх&quot;</b>. Калі функцыя "Опцыі пытання" вылучаная, то студэнт павінен выбраць усе правільныя адказы з прапанаваных варыянтаў. У пытанні можа гаварыцца <i>колькі</i> правільных адказаў мае пытанне. Напрыклад пытанне "Хто з ніжэйпрыведзеных асобаў быў прэзідэнтам?" - не гаворыць аб колькасці правільных адказаў, у той час як, "Вылучыце двух прэзідэнтаў з прапанаванага спісу" - гаворыць. Лік правільных адказаў можа вагацца ад <b>аднаго</b> да мноства варыянтаў адказаў. (Множны выбар "Некалькі з некалькіх" з адным правільным адказам і Множны выбар "Адзін з некалькіх" цалкам два розных тыпы пытання, бо першы дазваляе студэнту выбраць больш за адзін адказ, а апошні прадугледжвае выбар толькі аднаго адказу).</p></li>

<li><p><b>Кароткі адказ.</b> Па змаўчанні пры параўнанні адказу ігнаруецца рэгістр. Калі функцыя "Опцыі пытання" выбраная, то пры параўнанні адказу ўлічваецца рэгістр.</p></li>
</ol>

<p>Іншыя тыпы пытанняў не выкарыстаюць функцыю "Опцыі пытання".</p>';
$string['numberofpagestoshow_help'] = '<p>Гэты параметр выкарыстоўваецца толькі для ўрокаў тыпу Флэш-Карта. Значэнне па змаўчанні 0 - гэта значыць, што ўсе старонкі/карты паказваюцца падчас ўроку. Настройка гэтага параметру ў ненулявое значэнне паказвае колькасць старонак, пасля якой будзе дасягнуты канец уроку і студэнту будзе паказаная адзнака.</p>

<p>Калі гэты параметр мае значэнне, якое перавышае колькасць старонак уроку, тады канец уроку будзе дасягнуты пасля паказу ўсіх старонак.</p>';
$string['overview_help'] = '<ol>
<li>Урок складаецца з набору <b>старонак</b> і, калі неабходна, <b>табліцаў зместу</b>.
</li>
<li>Старонка напоўненая некаторай <b>інфармацыяй</b>, якая звычайна заканчваецца <b>пытаннем</b>. Такая старонка мае назву <b>Старонка з пытаннем</b>.
</li>
<li>Кожная старонка звычайна мае набор <b>адказаў</b>.
</li>
<li>Кожны адказ мае тэкставае суправаджэнне, якое з\'яўляецца пры выбары адказу. Гэта тэкставае суправаджэнне мае назву <b>Водгук</b>.
</li>
<li>Гэтак жа з кожным адказам звязаны <b>Пераход</b>. Пераход можа быць адносным: гэтая старонка, наступная старонка; або абсалютным - паказваецца любая са старонак уроку або канец уроку.
</li>
<li>Па змаўчанні, першы адказ пераходзіць на <b>наступную старонку</b> урока. Наступныя адказы пераходзяць на бягучую старонку. Такім чынам, студэнту паказваецца тая ж самая старонка яшчэ раз, у выпадку калі ён не выбраў першы адказ.
</li>
<li>Наступная старонка вызначаецца ў адпаведнасці з <b>лагічнай паслядоўнасцю</b>. Гэта парадак старонак у адлюстраванні ўрока настаўніка. Гэты парадак можа быць зменены шляхам перасоўвання старонак у межах урока.
</li>
<li>Урок таксама мае <b>парадак навігацыі</b>. Гэта парадак старонак у адлюстраванні ўрока студэнта. Ён вызначаецца пераходамі, паказанымі для асобных адказаў і ён можа адрознівацца ад лагічнай паслядоўнасці. (Калі для пераходаў <i>не</i> былі змененыя іх значэнні па змаўчанні, лагічная паслядоўнасць захоўваецца). Настаўнік мае магчымасць змяняць парадак навігацыі.
</li>
<li>Пры адлюстраванні студэнту, адказы на пытанне звычайна перамяшаныя. Гэта азначае, што першы адказ з пункта погляду настаўніка, зусім не абавязкова будзе першым па ліку адказам у адлюстраванні пытання студэнта. (Больш таго, кожны раз пры паказе адказаў, яны будуць спарадкаваныя інакш). Выключэнне ўяўляе набор адказаў для тыпу пытання "Адпаведнасці", тут адказы паказваюцца ў тым жа парадку, як і ўводзіліся настаўнікам.
</li>
<li>Колькасць адказаў можа адрознівацца ад старонкі да старонкі. Да прыкладу, дапускаецца, што некаторыя старонкі могуць мець пытанне тыпу Так/Не, у той час, як іншыя маюць адзін правільны адказ і 3 няправільных.
</li>
<li>Цалкам магчыма зрабіць старонку без адказаў. Студэнту будзе паказаная кнопка <b>Працягнуць</b> замест набору адказаў.
</li>
<li>З мэтай ацэнкі ўроку, за <b>Правільны</b> адказ прымаецца пераход на старонку, якая змяшчаецца <i>ніжэй</i> па лагічным парадку, чым бягучая старонка.
За <b>Няправільны</b> адказ прымаецца той, які пераходзіць альбо на бягучую старонку, альбо <i>вышэй</i> па лагічным парадку чым бягучая старонка. Калі пераходы <i>не</i> змененыя, то за правільны прымаецца першы адказ з набору адказаў, астатнія лічацца няправільнымі.
</li>
<li>Пытанні могуць мець больш за адзін правільны адказ. Да прыкладу, калі абодва з пытанняў маюць пераход на наступную старонку, абодва з іх лічацца правільнымі. (Хоць студэнтам будзе паказаная наступная старонка пры выбары любога з правільных адказаў, водгук для гэтых двух адказаў можа адрознівацца).
</li>
<li>Пры праглядзе ўрока настаўнікам, правільны адказ падкрэслены.
</li>
<li><b>Табліцы зместу</b> уяўляюць сабой простыя старонкі, якія маюць спасылкі на іншыя старонкі ўрока. Звычайна ўрок пачынаецца з Табліцы зместу, якая грае ролю <b>Зместу</b>.
</li>
<li>Кожная спасылка ў табліцы зместу складаецца з дзвюх частак: апісанне спасылкі і загаловак старонкі, на якую робіцца спасылка.
</li>
<li>Табліца зместу дзеліць урок на некаторую колькасць секцыяў. Кожная секцыя можа ўтрымліваць набор старонак (як правіла, яны адносяцца да адной тэмы). Канец секцыі звычайна заканчваецца старонкай <b>Канец зместу</b>. Гэта адмысловая старонка, якая звычайна вяртае студэнта да папярэдняй табліцы зместу. (Пераход са старонкі "Канец зместу" можа быць зменены, калі гэта неабходна).
</li>
<li>Ва ўроку можа быць больш за адну Табліцу зместу. Да прыкладу, урок можа быць з поспехам падзелены на падсекцыі ў межах адной Табліцы зместу.
</li>
<li>Гэта вельмі важна, даваць студэнту магчымасць убачыць канец урока. Гэта можа быць зроблена шляхам дадавання спасылкі "Канец урока" на галоўнай Табліцы зместу, пры пераходзе на якую урок будзе завершаны. Іншы варыянт завяршэння ўроку прызначаны для апошняй (паводле лагічнага парадку) Табліцы зместу ва ўроку. У гэтым выпадку можна не дадаваць Канец зместу, урок будзе завершаны па дасягненні яго апошняй старонкі.
</li>
<li>Калі ўрок уключае адну альбо больш табліцаў зместу, рэкамендуецца ўсталяваць параметр "Мінімальная колькасць пытанняў" з наступнай прычыны. Справа ў тым, што гэты параметр выстаўляе ніжнюю мяжу колькасці прагледжаных старонак з якіх складаецца ацэнка. Без гэтага параметру студэнт можа наведаць адну секцыю ўроку, адказаць на ўсе пытанні правільна і пакінуць урок з максімальнай адзнакай.
</li>
<li>У далейшым, калі маецца Табліца зместу, студэнт мае магчымасць наведваць адну і тую ж секцыю больш за адзін раз. Варта адзначыць, што адзнака складаецца з колькасці старонак на якія адказвалі <i>адзін</i> раз. Такім чынам, паўторны адказ на адзін і той жа набор пытанняў аніяк не павялічвае адзнаку. (Больш за тое, такі адказ заніжае адзнаку, бо колькасць прагледжаных старонак выкарыстоўваецца ў назоўніку пры разліку адзнакі). Для таго, каб паказаць студэнтам іх паспяховасць, ім дэманструецца ў дэталях інфармацыя аб тым, на колькі пытанняў яны далі правільныя адказы, агульную колькасць прагледжаных старонак і іх бягучую адзнаку па кожнай секцыі (Табліцы зместу) урока.
</li>
<li><b>Канец урока</b> дасягаецца альбо яўным пераходам на канец урока (з Табліцы зместу), або пры пераходзе на наступную старонку пасля апошняй (паводле лагічнага парадку). Калі канец урока дасягнуты, студэнт атрымлівае паведамленне віншавальнага характару і яму паказваецца ягоная адзнака за ўрок (лічба пытанняў на якія дадзеныя правільныя адказы/колькасць прагледжаных старонак).
</li>
<li>Калі Канец урока <b>не</b>  дасягнуты і студэнт яго проста пакідае, то пры паўторным наведванні ўрока студэнту будзе прапанавана пачаць урок ад пачатку, або працягнуць з апошняга пытання, на якое быў дадзены правільны адказ.
</li>
<li>Для ўрокаў, якія дазваляюць пераздачу, настаўнік можа абраць палітыку ацэнкі спробаў пераздачаў, да прыкладу, сярэднюю або максімальную адзнаку па ўсіх спробах, і выкарыстаць як канчатковую адзнаку за ўрок.</li>
</ol>';
$string['retakesallowed_help'] = '<p>Гэты параметр вызначае магчымасць праходжання студэнтам уроку больш за адзін раз. Напрыклад, настаўнік вырашыў, што ўрок утрымлівае матэрыял, які студэнт павінен ведаць бездакорна. У гэтым выпадку павінна быць прадугледжаная магчымасць пераздаць урок. Калі матэрыял уроку выкарыстоўваецца ў якасці іспыту, рэкамендавана выключыць магчымасць пераздачы.</p>

<p>Калі студэнту дазволена пераздаваць урок, адзнака паказаная на старонцы ацэнак можа быць альбо <b>сярэдняя</b> па ўсіх спробах пераздачы, альбо <b>лепшая</b> з іх. Наступны параметр - якая з гэтых палітык ацэньвання выкарыстоўваецца ва уроку.</p>

<p>Заўважце, што <b>аналіз пытання</b> заўжды выкарыстоўвае адказы з першай спробы, вынікі наступных пераздачаў ігнаруюцца.</p>

<p>Па змаўчанні гэтая опцыя стаіць ў рэжыме <b>Так</b>, гэта азначае, што студэнты могуць пераздаваць урок. Маецца на ўвазе, што толькі пры выключных абставінах гэтая опцыя фіксуецца ў рэжыме <b>Не</b>.</p>';
